---
kind: property
id: P:Autodesk.Revit.DB.ScheduleFilter.FilterType
source: html/bbf3558f-d6a6-1f19-1f89-d51e68072baa.htm
---
# Autodesk.Revit.DB.ScheduleFilter.FilterType Property

The filter type.

## Syntax (C#)
```csharp
public ScheduleFilterType FilterType { get; set; }
```

## Remarks
See ScheduleFilterType for details.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration